spawn vtysh

Hello, this is FRRouting (version 7.7-dev_git).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

router1# configure terminal
router1(config)# no ! Zebra configuration saved from vty
% Unknown command: no ! Zebra configuration saved from vty
router1(config)# ! Zebra configuration saved from vty
router1(config)# no !   2021/03/30 10:54:16
% Unknown command: no !   2021/03/30 10:54:16
router1(config)# !   2021/03/30 10:54:16
router1(config)# no frr version 7.7-dev_git
% Unknown command: no frr version 7.7-dev_git
router1(config)# frr version 7.7-dev_git
router1(config)# no frr defaults traditional
% Unknown command: no frr defaults traditional
router1(config)# frr defaults traditional
router1(config)# no hostname c1e4bc70ad30
(null)(config)# hostname c1e4bc70ad30
c1e4bc70ad30(config)# router bgp 102
c1e4bc70ad30(config-router)# bgp ebgp-requires-policy
c1e4bc70ad30(config-router)# no bgp ebgp-requires-policy
c1e4bc70ad30(config-router)# bgp network import-check
c1e4bc70ad30(config-router)# no bgp network import-check
c1e4bc70ad30(config-router)# no neighbor 192.168.0.1 remote-as 101
c1e4bc70ad30(config-router)# neighbor 192.168.0.1 remote-as 101
c1e4bc70ad30(config-router)# no neighbor 192.168.0.1 bfd
c1e4bc70ad30(config-router)# neighbor 192.168.0.1 bfd
c1e4bc70ad30(config-router)# no neighbor 192.168.0.1 timers 3 10
c1e4bc70ad30(config-router)# neighbor 192.168.0.1 timers 3 10
c1e4bc70ad30(config-router)# no neighbor 192.168.1.1 remote-as 103
c1e4bc70ad30(config-router)# neighbor 192.168.1.1 remote-as 103
c1e4bc70ad30(config-router)# no neighbor 192.168.1.1 bfd
c1e4bc70ad30(config-router)# neighbor 192.168.1.1 bfd
c1e4bc70ad30(config-router)# no neighbor 192.168.1.1 timers 3 10
c1e4bc70ad30(config-router)# neighbor 192.168.1.1 timers 3 10
c1e4bc70ad30(config-router)# no neighbor 192.168.2.1 remote-as 104
c1e4bc70ad30(config-router)# neighbor 192.168.2.1 remote-as 104
c1e4bc70ad30(config-router)# no neighbor 192.168.2.1 bfd
c1e4bc70ad30(config-router)# neighbor 192.168.2.1 bfd
c1e4bc70ad30(config-router)# no neighbor 192.168.2.1 timers 3 10
c1e4bc70ad30(config-router)# neighbor 192.168.2.1 timers 3 10
c1e4bc70ad30(config-router)# address-family ipv4 unicast
c1e4bc70ad30(config-router-af)# no network 10.254.254.2/32
c1e4bc70ad30(config-router-af)# network 10.254.254.2/32
c1e4bc70ad30(config-router-af)# exit
c1e4bc70ad30(config-router)# no exit-address-family
% Unknown command: no exit-address-family
c1e4bc70ad30(config-router)# exit-address-family
% Unknown command: exit-address-family
c1e4bc70ad30(config-router)# exit
c1e4bc70ad30(config)# no line vty
% Unknown command: no line vty
c1e4bc70ad30(config)# line vty
c1e4bc70ad30(config-line)# exit
c1e4bc70ad30(config)# exit
c1e4bc70ad30# exit
