spawn vtysh

Hello, this is FRRouting (version 7.7-dev_git).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

router3# configure terminal
router3(config)# no ! Zebra configuration saved from vty
% Unknown command: no ! Zebra configuration saved from vty
router3(config)# ! Zebra configuration saved from vty
router3(config)# no !   2021/03/14 20:54:09
% Unknown command: no !   2021/03/14 20:54:09
router3(config)# !   2021/03/14 20:54:09
router3(config)# no frr version 7.7-dev_git
% Unknown command: no frr version 7.7-dev_git
router3(config)# frr version 7.7-dev_git
router3(config)# no frr defaults traditional
% Unknown command: no frr defaults traditional
router3(config)# frr defaults traditional
router3(config)# no hostname 1c0506ecf01a
(null)(config)# hostname 1c0506ecf01a
1c0506ecf01a(config)# router bgp 65002
1c0506ecf01a(config-router)# no bgp router-id 2.2.2.2
1c0506ecf01a(config-router)# bgp router-id 2.2.2.2
1c0506ecf01a(config-router)# no timers bgp 3 9
1c0506ecf01a(config-router)# timers bgp 3 9
1c0506ecf01a(config-router)# no neighbor 1.1.1.1 remote-as 65001
1c0506ecf01a(config-router)# neighbor 1.1.1.1 remote-as 65001
1c0506ecf01a(config-router)# no neighbor 1.1.1.1 password hello1
1c0506ecf01a(config-router)# neighbor 1.1.1.1 password hello1
1c0506ecf01a(config-router)# no neighbor 1.1.1.1 ebgp-multihop 3
1c0506ecf01a(config-router)# neighbor 1.1.1.1 ebgp-multihop 3
1c0506ecf01a(config-router)# no neighbor 1.1.1.1 update-source lo
1c0506ecf01a(config-router)# neighbor 1.1.1.1 update-source lo
1c0506ecf01a(config-router)# no neighbor 1.1.1.1 timers 3 10
1c0506ecf01a(config-router)# neighbor 1.1.1.1 timers 3 10
1c0506ecf01a(config-router)# no neighbor 1.1.1.1 timers connect 10
1c0506ecf01a(config-router)# neighbor 1.1.1.1 timers connect 10
1c0506ecf01a(config-router)# no neighbor 3.3.3.3 remote-as 65003
1c0506ecf01a(config-router)# neighbor 3.3.3.3 remote-as 65003
1c0506ecf01a(config-router)# no neighbor 3.3.3.3 password hello3
1c0506ecf01a(config-router)# neighbor 3.3.3.3 password hello3
1c0506ecf01a(config-router)# no neighbor 3.3.3.3 ebgp-multihop 3
1c0506ecf01a(config-router)# neighbor 3.3.3.3 ebgp-multihop 3
1c0506ecf01a(config-router)# no neighbor 3.3.3.3 update-source lo
1c0506ecf01a(config-router)# neighbor 3.3.3.3 update-source lo
1c0506ecf01a(config-router)# no neighbor 3.3.3.3 timers 3 10
1c0506ecf01a(config-router)# neighbor 3.3.3.3 timers 3 10
1c0506ecf01a(config-router)# no neighbor 3.3.3.3 timers connect 10
1c0506ecf01a(config-router)# neighbor 3.3.3.3 timers connect 10
1c0506ecf01a(config-router)# exit
1c0506ecf01a(config)# no line vty
% Unknown command: no line vty
1c0506ecf01a(config)# line vty
1c0506ecf01a(config-line)# exit
1c0506ecf01a(config)# exit
1c0506ecf01a# exit
